<?php
$r = trim(htmlspecialchars($_GET['r']));
$html = "";

if($r == "no-page" or !$r)
{
 $z = "Грашна страница";
 $html = "За съжаление страницата или там, каквото се опитваш да търсш - може да не съществува или е било свалено от системния администратор. 
 При проблем - <a href='./?p=team'>свържи се с администратора</a>. 
 Благодаря !";
}
else if($r == "no-video")
{
 $z = "Грешно видео";
 $html = "За съжаление, няма такова видео в нашата система. Ако преди е имало, то значи е било отстранено.
 При проблем - <a href='./?p=team'>свържи се с администратора</a>. 
 Благодаря !";
}
else if($r == "no-server")
{
 $z = " Грешка в сървара";
 $html = "Възникна грешка в сървара. Администратора работи по отстраняването на проблема, но това може да отнеме около 10 мин. 
 При проблем - <a href='./?p=team'>свържи се с администратора</a>. 
 Благодаря !";
}

else if($r == "no-user")
{
 $z = " Няма такъв потребител";
 $html = "Потребителя, който търсиш най-вероятно НЕ съществува или е бил премахнат от системата !
 При проблем - <a href='./?p=team'>свържи се с администратора</a>. 
 Благодаря !";
}

$d = "Някой ";
if($_SESSION['is-logged'] == true) { $dd=$_SESSION['user']['username']; }
report($dd." бе препратен в страницата за грешки. Причина: ".$z);
?>
<div style="font-size:18px;color:#AA2927;font-family:Arial;padding:5px;">Оппа, възникна грешка !</div>
<?php echo error(nl2br($html));?>